/**
 * 菜单导航配置
 * time: 2018-09-07 by qiuchenglei
 */


/**
 *  @ platformArr { Array } '平台管理员相关导航菜单'
 */

export const platformArr = 
    [
      // 账号管理导航
      {t1: '平台管理员',t2:'账号管理导航',t3:'账号管理'},

      // 权限管理
      {t1: '平台管理员',t2:'权限管理',t3:'角色管理'},
      {t1: '平台管理员',t2:'权限管理',t3:'管理员设置'},

       // 权限管理
       {t1: '平台管理员',t2:'订单统计',t3:'销售订单'},

       // 质保卡申请
       {t1: '平台管理员',t2:'质保卡申请',t3:'质保卡申请'},

       // 其他设置
       {t1: '平台管理员',t2:'其它设置',t3:'轮播图管理'},
       {t1: '平台管理员',t2:'其它设置',t3:'退货原因设置'},
       {t1: '平台管理员',t2:'其它设置',t3:'订单设置'},
       {t1: '平台管理员',t2:'其它设置',t3:'支付设置'},
       {t1: '平台管理员',t2:'其它设置',t3:'分享次数设置'},

       // 资金管理
       {t1: '平台管理员',t2:'资金管理',t3:'资金账户'},
       {t1: '平台管理员',t2:'资金管理',t3:'提现申请'},
       {t1: '平台管理员',t2:'资金管理',t3:'账户资金'},

       // 消息管理
       {t1: '平台管理员',t2:'消息管理',t3:'消息模板'},
       {t1: '平台管理员',t2:'消息管理',t3:'消息记录'},      
    ]



/**
 *  @ DistributorArr { Array } '经销商相关导航菜单'
 */

export const DistributorArr = [
    // 用户管理
    {t1: '经销商用户',t2:'用户管理',t3:'普通用户'},
    {t1: '经销商用户',t2:'用户管理',t3:'厂商用户'},

    // 单据管理
    {t1: '经销商用户',t2:'单据管理',t3:'出售订单管理'},
    {t1: '经销商用户',t2:'单据管理',t3:'售后管理'},
    {t1: '经销商用户',t2:'单据管理',t3:'挂账申请'},
    {t1: '经销商用户',t2:'单据管理',t3:'挂账管理'},

    // 质保卡管理
    {t1: '经销商用户',t2:'质保卡管理',t3:'质保卡打印'},

    // 分类管理
    {t1: '经销商用户',t2:'分类管理',t3:'类别管理'},

    // 评价收藏
    {t1: '经销商用户',t2:'评价收藏',t3:'用户评价'},
    {t1: '经销商用户',t2:'评价收藏',t3:'收藏用户'},

    // 商品管理
    {t1: '经销商用户',t2:'商品管理',t3:'商品信息查看'},
    {t1: '经销商用户',t2:'商品管理',t3:'商品发布'},
    {t1: '经销商用户',t2:'商品管理',t3:'规格管理'},
    {t1: '经销商用户',t2:'商品管理',t3:'参数管理'},

    // 资金管理
    {t1: '经销商用户',t2:'资金管理',t3:'收入记录'},
    {t1: '经销商用户',t2:'资金管理',t3:'提现记录'},
    {t1: '经销商用户',t2:'资金管理',t3:'提现申请'},

    // 消息管理
    {t1: '经销商用户',t2:'消息管理',t3:'消息记录'},
]


/**
 *  @ ManufacturerArr { Array } '厂商管理员相关导航菜单'
 */

export const ManufacturerArr = [
    // 厂商用户管理导航
    {t1: '经销商用户',t2:'厂商用户管理导航',t3:'经销商用户管理'},
    {t1: '经销商用户',t2:'厂商用户管理导航',t3:'经销商请求'},

    // 权限设置
    {t1: '经销商用户',t2:'权限设置',t3:'角色设置'},
    {t1: '经销商用户',t2:'权限设置',t3:'管理员设置'},

    // 商品管理
    {t1: '经销商用户',t2:'商品管理',t3:'商品信息查看'},
    {t1: '经销商用户',t2:'商品管理',t3:'商品发布'},
    {t1: '经销商用户',t2:'商品管理',t3:'规格管理'},
    {t1: '经销商用户',t2:'商品管理',t3:'参数管理'},

    // 质保卡管理
    {t1: '经销商用户',t2:'质保卡管理',t3:'质保卡打印'},

    // 分类管理
    {t1: '经销商用户',t2:'分类管理',t3:'类别管理'},

    // 单据管理
    {t1: '经销商用户',t2:'单据管理',t3:'订单管理'},
    {t1: '经销商用户',t2:'单据管理',t3:'售后管理'},
    {t1: '经销商用户',t2:'单据管理',t3:'挂账申请'},
    {t1: '经销商用户',t2:'单据管理',t3:'挂账管理'},

    // 资金管理
    {t1: '经销商用户',t2:'资金管理',t3:'收入记录'},
    {t1: '经销商用户',t2:'资金管理',t3:'提现记录'},
    {t1: '经销商用户',t2:'资金管理',t3:'提现申请'},

    // 其他设置
    {t1: '经销商用户',t2:'其他设置',t3:'星级设置'},

    // 店铺管理
    {t1: '经销商用户',t2:'店铺管理',t3:'商铺信息'},

    // 货物追踪
    {t1: '经销商用户',t2:'货物追踪',t3:'货物追踪'},

    // 消息管理
    {t1: '经销商用户',t2:'消息管理',t3:'消息记录'},

]



    